**Create DataFrame**

In [1]:
import numpy as np
import pandas as pd

In [2]:
dic = {
    "Name":['Aryan','Rajeev', 'Sameer', "Tinku"],
    "Marks":[89,92,12,86],
    "City":["Bettiah","Japan", "Mars","Jupyter"],
    "Hobby":["Study","Coding","Gambling","Games"]
}

In [3]:
df = pd.DataFrame(dic)

In [4]:
df

     Name  Marks     City     Hobby
0   Aryan     89  Bettiah     Study
1  Rajeev     92    Japan    Coding
2  Sameer     12     Mars  Gambling
3   Tinku     86  Jupyter     Games

In [5]:
df.head(2)

     Name  Marks     City   Hobby
0   Aryan     89  Bettiah   Study
1  Rajeev     92    Japan  Coding

In [6]:
df.tail(2)

     Name  Marks     City     Hobby
2  Sameer     12     Mars  Gambling
3   Tinku     86  Jupyter     Games

In [7]:
df.to_csv("Friends.csv")

In [8]:
df.to_csv("Friends2.csv", index=False)

In [9]:
df.describe()

           Marks
count   4.000000
mean   69.750000
std    38.577843
min    12.000000
25%    67.500000
50%    87.500000
75%    89.750000
max    92.000000

**Read Data**

In [13]:
df = pd.read_csv("Friends.csv")

In [14]:
df

   Unnamed: 0    Name  Marks     City     Hobby
0           0   Aryan     89  Bettiah     Study
1           1  Rajeev     92    Japan    Coding
2           2  Sameer     12     Mars  Gambling
3           3   Tinku     86  Jupyter     Games

In [15]:
df.index = ['First','Second','Third','Fourth']

In [19]:
df['Hobby'][0] = 'Cooking'

C:\Users\theer\AppData\Local\Temp/ipykernel_9088/739160821.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Hobby'][0] = 'Cooking'

In [20]:
df

        Unnamed: 0    Name  Marks     City     Hobby
First            0   Aryan     89  Bettiah   Cooking
Second           1  Rajeev     92    Japan    Coding
Third            2  Sameer     12     Mars  Gambling
Fourth           3   Tinku     86  Jupyter     Games